from core.database import async_session_maker
from core.models.user import User
import asyncio
import os
from dotenv import load_dotenv

load_dotenv()


user_names = [
    'Александр', 'Алексей', 'Анатолий', 'Андрей', 'Антон', 'Аркадий', 'Арсений', 'Артём', 'Борис', 'Вадим',
    'Валентин', 'Валерий', 'Василий', 'Виктор', 'Виталий', 'Владимир', 'Владислав', 'Вячеслав', 'Геннадий', 'Георгий',
    'Григорий', 'Даниил', 'Денис', 'Дмитрий', 'Евгений', 'Егор', 'Иван', 'Игорь', 'Илья', 'Кирилл',
    'Константин', 'Леонид', 'Максим', 'Марат', 'Михаил', 'Никита', 'Николай', 'Олег', 'Павел', 'Пётр',
    'Роман', 'Руслан', 'Сергей', 'Станислав', 'Степан', 'Тимофей', 'Фёдор', 'Филипп', 'Юрий', 'Ярослав',
    'Анастасия', 'Анна', 'Валентина', 'Валерия', 'Вера', 'Виктория', 'Галина', 'Дарья', 'Евгения', 'Екатерина',
    'Елена', 'Елизавета', 'Жанна', 'Зинаида', 'Зоя', 'Ирина', 'Карина', 'Кира', 'Ксения', 'Лариса',
    'Лидия', 'Любовь', 'Людмила', 'Маргарита', 'Марина', 'Мария', 'Надежда', 'Наталья', 'Нина', 'Оксана',
    'Ольга', 'Полина', 'Раиса', 'Регина', 'Римма', 'Светлана', 'София', 'Таисия', 'Тамара', 'Татьяна',
    'Ульяна', 'Юлия', 'Яна', 'Алина', 'Диана', 'Ева', 'Милана', 'Алиса', 'Варвара', 'Василиса'
]

async def main():
    async with async_session_maker() as session:
        for username in user_names:
            email = f"{username}@example.com"
            user = User(username=username, email=email, password=os.getenv("USER_PASSWORD"))
            session.add(user)
            await session.commit()

if __name__ == "__main__":
    asyncio.run(main())
